[
    {
        "id":1234,
        "name":"Rustic Red Wine Spaghetti",
        "veg":true,
        "imageurl":"https://img.spoonacular.com/recipes/452116-312x231.jpg",
        "catagoryId":1,
        "Servings":2,
        "ReadyInMintues":"40 Mins",
        "Healthscore":100,
        "Ingredients":["rosemary","garlic","mushrooms","olive oil","parmesan cheese","red wine","saltand pepper","savoy cabbage","walnuts","spaghetti"],
        "Summary":"Rustic Red Wine Spaghetti might be a good recipe to expand your main course recipe box. For $3.38 per serving, this recipe covers 47% of your daily requirements of vitamins and minerals. One serving contains 865 calories, 37g of protein, and 40g of fat. This recipe serves 2. A mixture of salt and pepper, garlic, walnuts, and a handful of other ingredients are all it takes to make this recipe so scrumptious. It is brought to you by spoonacular user coffeebean. From preparation to the plate, this recipe takes approximately 40 minutes. If you like this recipe, you might also like recipes such as Rustic Blueberry Cake Clafoutis, Rustic Brie Toasts with Wild Mushroom, Cranberry and Shallot, and Rustic Grilled Peaches Pizza.",
        "RecipeNutrition":{
            "calories":42.8,
            "Fat":61.4,
            "protein":70.6,
            "Manganese":222
        
        },
        "steps":[
           "In a small skillet, fry the garlic in olive oil until fragrant.",
            "Add the mushrooms. When the mushrooms are almost done, add the fresh rosemary, be careful not to let it burn.",
            "In a large skillet, fry the chopped savoy cabbage until the desired level of crispiness is achieved.",
            "Once the cabbage is nearly done, pour half of the bottle of wine into a pot.Dilute with boiling water until you have enough to cook the pasta in (but try not to dilute it too much). Bring to a boil and salt the water.",
            "Add the spaghetti.",
            "Drain the pasta, reserving about 1/4 cup of the pasta water.",
            "Add the pasta to the skillet with the cabbage.",
            "Add the mushrooms and rosemary (you might want to de-glaze the pan they were in with some more wine).",
            "Add the reserved wine/water mixture to the pan with the pasta and cabbage. Season with salt and pepper.",
            "Add olive oil if it's too dry, and don't forget plenty of Parmesan."
    ]

    },
    
    {
        "id":12345,
        "name":"Alouette Chicken Paprika",
        "veg":false,
        "imageurl":"https://img.spoonacular.com/recipes/632244-312x231.jpg",
        "catagoryId":1
    },
    
    {
        "id":123456,
        "name":"Card image cap Cranberry Pumpkin Bread",
        "veg":true,
        "imageurl":"https://img.spoonacular.com/recipes/66686-312x231.jpg",
        "catagoryId":2
    },
    
    {
        "id":1234567,
        "name":"Simit (Turkish Circular Bread)",
        "veg":false,
        "imageurl":"https://img.spoonacular.com/recipes/631759-312x231.jpg",
        "catagoryId":2
    },
     {
        "id":12456,
        "name":"Cumin and Paprika Rubbed Chicken Drumsticks",
        "veg":false,
        "imageurl":"https://img.spoonacular.com/recipes/641029-312x231.jpg",
        "catagoryId":3
    },
    
    {
        "id":134567,
        "name":"Beef Fajita Marinade",
        "veg":false,
        "imageurl":"https://img.spoonacular.com/recipes/715567-312x231.jpg",
        "catagoryId":3
    }
        
]